# 4) Напишите программу, которая по заданному номеру четверти, показывает диапазон возможных координат точек в этой четверти (x и y).




print('Введите номер четверти')

n  = int(input())

if n <1 or n > 4:
    print('Введите номер четверти от 1 до 4')
else:
    if n == 1:
        print('x > 0, y > 0')
    if n == 2:
        print('x < 0, y > 0')
    if n == 3:
        print('x < 0, y < 0')
    if n == 4:
        print('x > 0, y < 0')

