# 3) Напишите программу, которая принимает на вход координаты точки (X и Y), 
# причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости, в которой находится эта точка.
# *Пример:*

# - x=34; y=-30 -> 4
# - x=2; y=4-> 1
# - x=-34; y=-30 -> 3


print('Введите координаты точки')

x  = int(input('x = '))
y  = int(input('y = '))

if x == 0 or y == 0:
    print('Введите координаты точки не равные нулю')
else:
    if x > 0 and y > 0:
        print('1 четверть')
    if x < 0 and y > 0:
        print('2 четверть')
    if x < 0 and y < 0:
        print('3 четверть')
    if x > 0 and y < 0:
        print('4 четверть')