# 1) Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
# *Пример:*

# - 6 -> да
# - 7 -> да
# - 1 -> нет


print('Введите цифру от 1 до 7, обозначающую день недели   ')

dn = int(input())

if dn == 6 or  dn == 7:
    print('Да')
else:
    print('Нет')
